#include <stdio.h>

int main(void)
{
	/*
	¿ª ÇÇ¶ó¹Ìµå 
	*********  º° 9°³ ºóÄ­ 0°³ i = 4 j = 0 
	 *******   º° 7°³ ºóÄ­ 2°³ i = 3 j = 1 ºóÄ­ÀÌ j°¡ 0ÀÎ ºÎºÐ°ú ¸¶Áö¸·¿¡ ÂïÈû
	  *****    º° 5°³ ºóÄ­ 4°³ i = 2 j = 2 
	   ***     º° 3°³ ºóÄ­ 6°³ i = 1 j = 3 
	    *      º° 1°³ ºóÄ­ 8°³ i = 0 j = 4 

	ºóÄ­ : (i*2)°³
    */
	int i, j;

	for (i = 4; i >= 0; i--)
	{
		// ¿ªÇÇ¶ó¹Ìµå
		for (j = 5; j > i+1; j--)
		{
			printf(" ");
		}
		for (j = 0; j < 2*i+1; j++)
		{
			printf("*");
		}
		
		// ÇÇ¶ó¹Ìµå i ¸¦ 0ºÎÅÍ ¹Ù²ã¾ßÇÔ 
		/*for (j = 4; j > i; j--)
		{
			printf(" ");
		}

		for (j = 0; j < 2 * i + 1; j++)
		{
			printf("*");
		}*/

		printf("\n");
	}

	return 0;

}